<?php
require(__DIR__. "/../../framework/ver2/common.php");
$obj = array(
	"made" => "2021-11-22",
	"updated" => "2021-11-22"
);
head($obj);
?>
<h2>管理会計とは</h2>
管理会計とは財務会計に対比される会計で、財務会計が外部へ報告することを目的とするのに対して、管理会計では企業内部の経営者等へ報告することを目的とします。
<h2>日本原価計算の起源</h2>
日本の原価計算の起源は明治時代にまで遡ります。<br /><br />開国・江戸幕府の終焉によって明治時代がスタートしました。<br /><br />明治政府は「富国強兵」「殖産興業」を唱えて舵を切りましたが、ここでの大きな問題は極度の財政難でした。<br /><br />そこで予算編成に際して不要な支出を削減するために、明治2年「出納司規則書」、明治6年「金穀出納順序」、明治7年「各支庁経費渡方并勘定帳差出方規則」、明治8年「経費概計表及内訳明細簿ヲ製スル順序」を制定しました。<br /><br />この法制度の整備が日本原価計算の起源と言われます。
<h2>大蔵省出納條例</h2>
明治9年には「<strong>大蔵省出納條例</strong>」が制定されて、支出削減制作がより実務的に支持されました。<br /><br />この條例では「費目の区分・記帳・集計・報告」についての諸規則を定めて、いわゆる原価計算の基礎となる費目別計算が整備されました。<br /><br />また、実際に先立って支出を予測算出して管理する(予算)ことは、管理会計としての原価計算という性質を有していました。
<h2>出納司規則書</h2>
明治政府は明治維新において経済の復興・再構築を重要視しました。<br />そのため国家会計システムと構築の一環として、「<strong>出納司規則書</strong>」を制定しました。<br />この目的は金穀の収支を監督し国庫金の濫費を防ぐことにあります。
<div class="column">
	明治政府の財政難に関して、井上馨と渋澤栄一によって明治6年に「政府の財政は破綻している」という建議を提出して明治政府の財政的な破綻を指摘する一方で、明治政府は明治7年に「明治7年　歳入出見込会計表」によってこれに反論しました。<br /><br />この建議の是非については諸論ありますが、いずれにしても、この明治初期の極度な財政難から支出を削減する政策が日本原価計算の始まりであったと言えます。
</div>
<h3>歳入出見込会計表</h3>
井上馨と渋澤栄一による明治政府財政破綻論に反論するために明治政府が制定した「歳入出見込会計表」は日本における最初の予算編成であり、国家収支の内訳となる費目を明確に規定した会計表であったと言えます。
<h2>金穀出納順序</h2>
出納司規則書の大きな弱点は各府県や各院省には金銭出納に関する明確な規程がなかったことです。<br />「<strong>金穀出納順序</strong>」ではこれを克服しました。<br /><br />金穀出納順序の特徴は以下の通りです。
<br />
<ol>
	<li>発生した諸経費については内訳明細表を作成することを規定</li>
	<li>内訳明細表・勘定帳を大蔵省に送付することを規定</li>
	<li>常費と臨時費を区別</li>
	<li>大蔵省は常費中の定額金を各省へ12等分して毎月、府県へは年2回に分けて交付することを規定</li>
	<li>予備費の残金についての取り扱いに関して規定</li>
</ol>
<br />
「1」「2」によって政府が下の省庁(各府県や各院省)の会計を管理する規定が金穀出納順序によって制定されたことが見てとれますね♪<br /><br />「3」で「常費」と「臨時費」を区別したことも原価計算の特徴が現れています。<br /><br />また、どちらかというと原価計算(管理会計)ではなく財務会計に関することですが、「4」「5」に関しては会計期間の設定と捉えることができます。
<h3>報告の強化</h3>
金穀出納順序が規定した内訳明細表・勘定帳の大蔵省への送付に関連して、これを速やかに行うために「各庁経費渡方并勘定帳差出規則」が制定されました。<br /><br />これによって報告期限について厳格に規定しました。<br /><br />また、「経費概計表及内訳明細簿ヲ製スル順序」によって報告内容も厳格に定めました。<br /><br />他にも「収入金穀概計表ヲ製スルノ順序」および「経費概計表及内訳明細簿ヲ製スル順序」によって実際の収支だけでなく収支の概算を報告する法制度が整えられました。<br />ここでは発生する経費を「定額常費」「額外常費」「臨時費」に分類しています。
<?php footer(); ?>