<?php
require(__DIR__. "/../../framework/ver2/common.php");
$obj = array(
	"made" => "2021-11-22",
	"updated" => "2021-11-22"
);
head($obj);
?>
<h2>ドイツへの傾倒の流れ</h2>
第一次世界大戦後に政治的にドイツとの関わりが強くなりました。<br /><br />特に陸軍将校たちが将来起こる戦争をイメージしてドイツに学んだ総動員思想を抱くようになり、また同時に発生していた大恐慌の中で資本主義から離脱する流れの中でドイツを模倣して市場へ介入できる体制づくりに着手しました。<br /><br />第一次世界大戦以降は戦争継続に不可欠な「生産力拡充」と「低物価抑制」が重要視されることを学んで、政府はこれらの政策を実現する手段としてドイツを模範とした原価計算制度の導入を試みました。<br /><br />また、ドイツの戦争後にすぐに経済を復興した点、製造工程の合理化による生産力拡充・適正原価に基づく低物価抑制に対して原価計算制度が有効に機能している点を評価してこれを取り入れようとしたと言えます。
<h2>重要産業ノ統制ニ関スル法律</h2>
大恐慌の中で資本主義に限界を唱える主張が増え、政府によるカルテル結成の促進・企業間の過剰な競争の排除・生産量および価格の統制が試みられました。<br /><br />これを実行するために、政府は明治5年に商工省に臨時産業合理局を設置して以下の対策をとりました。
<br />
<ul>
	<li>産業合理化運動の推進</li>
	<li>規格の統一化</li>
</ul>
<br />
その後、政府は「重要産業ノ統制ニ関スル法律」を制定して、カルテル・トラストの結成の推進・企業間の過剰な競争の排除・生産量および価格の統制を本格化させました。<br /><br />またこれ以降、政府は「輸出品等臨時措置法」「臨時資金調整法」「軍需工業動員法」「国家総動員法」「国民徴用令」を制定して統制経済の実現を図りました。<br /><br />昭和15年に制定された「物価統制大綱」「価格等統制令」によって政府は価格競争を正式に廃止させました。
<h2>基本原価計算準則・製造原価計算準則</h2>
臨時産業合理局財務管理委員会は昭和8年に「基本原価計算準則」、昭和12年に「製造原価計算準則」を制定して統制経済の実現を図りましたが、結果としてこれによってドイツ原価計算制度を源流とする原価計算制度が日本に浸透しました。<br /><br />以下では「基本原価計算準則」と「製造原価計算準則」について説明していきます。
<h3>「基本原価計算準則」</h3>
「基本原価計算準則」では価格設定の基礎となる総原価までの計算が規定されているため、その目的は価格設定であると言えます。<br /><br />また、製造間接費の配賦の枠組みで部門別計算が説明されており、全ての原価を製品に配賦する観点から製造間接費の直接費への転化が強調されていることも特徴として挙げられます。
<img src="../pics/基本準則における原価構成.png" alt="基本準則における原価構成の画像" />
<h3>「製造原価計算準則」</h3>
「製造原価計算準則」では「基本原価計算準則」と異なり、部分および全体企業業績の測定に強調点が置かれている点から、その目的は能率の向上であると言えます。
<img src="../pics/製造準則における原価構成.png" alt="製造準則における原価構成の画像" />
<h4>特徴</h4>
「製造原価計算準則」の特徴は以下の3つです。
<br />
<ul>
	<li>販売費及び一般管理費の規定をしていない</li>
	<li>部門別計算を製造間接費の配賦とは別の枠組みで説明</li>
	<li>標準原価計算を規定</li>
	<li>工業会計との関連を規定</li>
</ul>
<?php footer(); ?>