<?php
require(__DIR__. "/../../framework/ver2/common.php");
$obj = array(
	"made" => "2021-12-12",
	"updated" => "2021-12-12"
);
head($obj);
?>
<h2>製造工業原価計算要綱の目的</h2>
製造工業原価計算要綱が制定される以前は海軍と陸軍で異なる原価計算制度を使用していました。<br /><br />しかしながら、陸軍と海軍で異なる原価計算制度を使用することは陸軍と海軍の両方に物資を納入している工場事業場などでの処理が複雑化する他、陸軍と海軍双方を用いる戦争では不都合でした。<br /><br />また、戦争中により強力な価格統制のため、民間向上に関しても原価計算制度を使用させる必要がありました。
<img src="../pics/原価計算の統一.png" alt="原価計算の統一" />
<h2>陸軍要綱と海軍準則の統一</h2>
国家総動員法が制定され本格的な戦時体制が確立されると、民需物資の高騰抑制のために市場価格ではなく中庸生産費(生産費)を元に価格を決定する必要性が生じました。<br />これを実現するために、企画院は物価統制の目的で軍需品工場のみならず一般工場にも原価計算制度を実施させ、これに関して「企画院要綱」を作成して制度を確立しました。<br /><br />また、これを基に「原価計算規則」が制定されました。<br />以下の4条からなります。
<ol>
	<li>価格等統制令第十條、会社経理統制令第三十六條第一項又ハ軍需品工場事業場検査令第四條ノ規定ニ依ル原価計算ニ関シテハ本令ノ定ムル所ニ依ル</li>
	<li>原価計算ノ準則ハ別冊製造工業原価計算要綱ニ基キ業種別又ハ業種ノ経営規模別ニ主務大臣之ヲ定メ告示ス<br />原価計算ニ関シ提出セシムベキ報告書類ノ様式ハ前項ノ規定ニ依ル準則毎ニ主務大臣之ヲ定メ告示ス</li>
	<li>主務大臣原価計算ヲ為スベキ事業主ノ範圍及原価計算ヲ開始スベキ期日ヲ指定シタルトキハ当該事業主ハ前條ノ規定ニ依ル準則ニ基キ原価計算ヲ為スベシ但シ主務大臣ノ許可ヲ受ケタルトキハ原価計算ノ開始ノ期日ヲ延期スルコトヲ得</li>
	<li>事業主前條ノ規定ニ依リ原価計算ヲ為サントスルトキハ第二條ノ規定ニ依ル準則ニ基キ原価計算ノ実施手続ヲ定メ原価計算開始ノ期日迄ニ之ヲ主務大臣ニ提出スベシ</li>
</ol>
<?php footer(); ?>