<?php
require(__DIR__. "/../../framework/ver2/common.php");
$obj = array(
	"made" => "2021-11-22",
	"updated" => "2021-11-22"
);
head($obj);
?>
<h2>鉄道会計の概要</h2>
その性質上収益があげられない海軍工廠と異なり、鉄道工場では収益があげられるため独立採算会計が求められました。<br /><br />そのため、工場経理規程という原価計算に関する規定を制定して、鉄道工場における原価計算を整備しました。
<h2>複会計制度</h2>
19世紀のイギリスにおいて鉄道業・電灯・ガス・水道などの公益事業において採用された会計制度であり、その特徴は企業資本を固定資本と運転資本とに分別経理することです。<br /><br />上記の業種(鉄道業・電灯・ガス・水道)においては、固定資産(固定資本)の割合が大きく、この固定資産が会計上大きな意味を持つためこれを運転資本から分離しています。
<h2>鉄道会計の仕組み</h2>
鉄道会計では、前の授業で説明した印刷工場や海軍工廠と同様に「作業費に関する3規程」が適用され、また、「工場経理規程」も採用されていたため、体系的な原価計算制度を有して経常的な工事費計算が行われていました。
<h2>工場経理規程(明治43年版)</h2>
工場経理規定においては、落成価格（製造原価）はまず、材料費と工作費に分類されます。<br /><br />工場の全体費用の集計については工場勘定を用いて管理しています。<br />これによって内部の価値移転の記録が可能になっています。<br /><br />材料費は工事に要した物品の消費額、労務費(工作費)は職工賃と間接費の合算額と定義されます。<br /><br />しかしながら、明治43年版の工場経理過程では工場勘定の役割や細かい工事費の集計は規定されていません。<br /><br />そのため、明治43年版の工場経理過程はかなり予算管理志向型規程であったと言えます。
<h2>工場経理規程(大正12年版)</h2>
大正12年版の工場経理過程ではその目的を工場における工事費の計算としています。<br /><br />大正12年版工場経理過程も明治43年版と同様に工場の全体費用の集計については工場勘定を用いて管理していますが、大正12年版ではこれをより詳細に規定したため、損益計算志向型規程であったと言えます。
<?php footer(); ?>