<?php
include("common.php");
head("基礎知識(工)");
?>
<h2>工業簿記(管理会計)の意義</h2>
<span class="u">商業簿記が期間損益計算(1会計期間にどれだけの利益をあげたか)を算定する</span>のに対して、<span class="u">工業簿記では原価計算(製品単位当たりの利益)を算定する</span>ことを目的とします。
<h2>財務会計と管理会計</h2>
<table>
	<thead>
		<tr>
			<td width="50%">財務会計</td>
			<td width="50%">管理会計</td>
		</tr>
	</thead>
	<tbody>
		<tr>
			<td>会社外部の人の報告するための会計です。</td>
			<td>会社内部の人に報告するための会計です。</td>
		</tr>
		<tr>
			<td>財務諸表(貸借対照表・損益計算書・製造原価明細書)を企業外部の利害関係者に提供します。</td>
			<td>
				<ul>
					<li>業績評価目的(経常)<br />->経営計画と経営統制</li>
					<li>経営意思決定目的(臨時)<br />->業務的意思決定と構造的意思決定</li>
				</ul>
			</td>
		</tr>
	</tbody>
</table>
<h2>原価計算の種類</h2>
原価計算は以下の観点から分類することが可能です。<br />
<ul>
	<li>経常か臨時か</li>
	<li>実際か標準か</li>
	<li>個別か総合か</li>
</ul>
<br />
<h3>経常か臨時か</h3>
原価計算は経常的に行うか、臨時的に行うかで以下の2つに分類されます。<br />
<ul>
	<li>原価計算制度</li>
	<li>特殊原価調査</li>
</ul>
<table class="exp">
	<thead>
		<tr>
			<td width="50%">原価計算制度</td>
			<td width="50%">特殊原価調査</td>
		</tr>
	</thead>
	<tbody>
		<tr>
			<td class="center">経常</td>
			<td class="center">臨時</td>
		</tr>
		<tr>
			<td>複式簿記と結合して常時継続的に行われる原価計算です。</td>
			<td>特殊な原価概念(差額原価・機会原価)を用いて臨時的に行われる原価計算です。</td>
		</tr>
	</tbody>
</table>
<h3>実際か標準か</h3>
原価計算は実際原価で行うか、標準原価で行うかで以下の2つに分類されます。<br />
<ul>
	<li>実際原価計算制度</li>
	<li>標準原価計算制度</li>
</ul>
<table class="exp">
	<thead>
		<tr>
			<td width="50%">実際原価計算制度</td>
			<td width="50%">標準原価計算制度</td>
		</tr>
	</thead>
	<tbody>
		<tr>
			<td>単位製品当たりの製造原価を実際にかかった原価で計算します。</td>
			<td>単位製品当たりの製造原価を予め定めた目標となる原価で計算します。</td>
		</tr>
	</tbody>
</table>
<h3>個別か総合か</h3>
原価計算制度はオーダーメイド方式で製造するか、大量生産方式で製造するかで以下の2つに分類されます。<br />
<table class="exp">
	<thead>
		<tr>
			<td width="50%">個別原価計算</td>
			<td width="50%">総合原価計算</td>
		</tr>
	</thead>
	<tbody>
		<tr>
			<td>顧客の注文に応じて特定の製品を個別に製造する形態の生産において用いられます。</td>
			<td>同じ規格の製品をまとめて大量に製造する形態の生産において用いられます。</td>
		</tr>
	</tbody>
</table>
<h2>原価概念</h2>
<h3>原価要件</h3>
原価とは、「<span class="u">経営給付に直接関連付けられる支出</span>」と定義されますが、具体的には以下の4つの原価要件を満たす必要があります。<br />
<ul>
	<li>経営価値消費性</li>
	<li>給付関連性</li>
	<li>経営目的関連性</li>
	<li>正常性</li>
</ul>
<br />
したがって、これらの要件を満たさない「営業外費用・特別損失・税法上でのみ認められている項目・その他利益剰余金」は原価に該当しません。
<h3>原価と費用</h3>
「原価」と似た用語として「費用」がありますが、会計の世界においては両者は明確に区別されます。
<table class="exp">
	<thead>
		<tr>
			<td width="50%">費用</td>
			<td width="50%">原価</td>
		</tr>
	</thead>
	<tbody>
		<tr>
			<td class="center">財務会計</td>
			<td class="center">管理会計</td>
		</tr>
		<tr>
			<td class="center">期間的対応</td>
			<td class="center">製品別対応</td>
		</tr>
	</tbody>
</table>
<h3>原価の構成</h3>
上記の原価を要件を満たす項目は大きく以下の3つから構成されます。<br />
<ul>
	<li>製造原価<br />(「工場」で発生)</li>
	<li>販売費<br />(「営業所」で発生)</li>
	<li>一般管理費<br />(「本社」で発生)</li>
</ul>
<br />
また、この3つを総称して<strong>総原価</strong>と言います。
<h3>原価の分類</h3>
原価は以下の4つの観点から分類することができます。<br />
<ul>
	<li>形態別</li>
	<li>製品との関連</li>
	<li>操業度との関連</li>
	<li>管理可能性</li>
</ul>
<br />
<h4>形態別</h4>
<table class="exp">
	<tbody>
		<tr>
			<th>材料費</th>
			<td>物品の消費により発生する原価を言います。</td>
		</tr>
		<tr>
			<th>労務費</th>
			<td>労働力の消費により発生する原価を言います。</td>
		</tr>
		<tr>
			<th>経費</th>
			<td>材料費・労務費以外の原価要素の消費により発生する原価を言います。</td>
		</tr>
	</tbody>
</table>
<h4>製品との関連</h4>
<table class="exp">
	<tbody>
		<tr>
			<th>製造直接費</th>
			<td>使用先である製品が明確である原価を言います。</td>
		</tr>
		<tr>
			<th>製造間接費</th>
			<td>使用先である製品が不明である原価を言います。</td>
		</tr>
	</tbody>
</table>
<h4>操業度との関連</h4>
<table class="exp">
	<tbody>
		<tr>
			<th>変動費</th>
			<td>操業度の比例して発生している原価を言います。</td>
		</tr>
		<tr>
			<th>固定費</th>
			<td>操業度に関わらず、常に一定額発生する原価を言います。</td>
		</tr>
	</tbody>
</table>
<h4>管理可能性</h4>
<table class="exp">
	<tbody>
		<tr>
			<th>管理可能費</th>
			<td>ある一定の階層の管理者によって管理ができる原価を言います。</td>
		</tr>
		<tr>
			<th>管理不能費</th>
			<td>ある一定の階層の管理者によって管理ができない原価を言います。</td>
		</tr>
	</tbody>
</table>
<h2>原価計算の手順</h2>
原価計算は以下の3つの手順を踏みます。<br />
<ol>
	<li>費目別計算</li>
	<li>部門別計算</li>
	<li>製品別計算</li>
</ol>
<br />
<table class="exp">
	<tbody>
		<tr>
			<th>費目別計算</th>
			<td>「材料費・労務費・経費」に関して支払計算と消費計算を行います。</td>
		</tr>
		<tr>
			<th>部門別計算</th>
			<td>製造間接費を仕掛品に配賦します。</td>
		</tr>
		<tr>
			<th>製品別計算</th>
			<td>仕掛品を製品に分配します。</td>
		</tr>
	</tbody>
</table>
<?php footer(); ?>
