<?php
require_once("common.php");
include_head("情報セキュリティ");
?>

<div id = "main">
	<p id = "my_comment">セキュリティがしっかりしているシステム・プログラムとは何でしょうか???<br>多くの人は情報が漏洩しないシステム・プログラムを想像すると思います。<br>しかしながら、せっかく情報が漏洩しないシステムを完成させてもシステムが保有する情報が改竄されたり、大量のデータを送り付けられて使えなくなったりしては意味がありませんよね、、、<br>ではセキュリティとは何でしょうか???<br>ここでは、<strong>「セキュリティとは」</strong>について考えましょう♪<br><br>それでは、Lst's start!</p>

	<h2>セキュリティとは</h2>

	<p>セキュリティとは、、、<br><br>ISMS(Information Security Management System/情報セキュリティマネジメントシステム)に関する国際的標準規格であるISO/IEC27000またはその日本版であるJIS27000ファミリーでは、<strong>「情報の<span class = "underline">機密性、完全性、可用性</span>を確保すること」</strong>と定義されます。<br>それぞれの頭文字を取って<strong>CIA</strong>とよく表されます。</p>
	<div class ="scroll_x">
		<table border = "1" id = "cia">
			<caption>情報セキュリティの特性</caption>
			<tbody>
				<tr>
					<th>C</th>
					<td>機密性(Confidentiality)</td>
				</tr>
				<tr>
					<th>I</th>
					<td>完全性(Integrity)</td>
				</tr>
				<tr>
					<th>A</th>
					<td>可用性(Availability)</td>
				</tr>
			</tbody>
		</table>
	</div>
	<p>機密性とは、秘密にするべき情報を秘密に保持すること、<br>完全性とは、保有する情報が不正に書き換えられたり(改竄されたり)しないこと、<br>可用性とは、そのシステムが利用したいときに利用できる状態にあること、<br><br>を指します。</p>


	<h2>セキュリティの付加的特性</h2>
	<p>ここでは、前述したセキュリティの特性(CIA)を達成するにあたり、大切となる付加的な特性について学びましょう♪<br>情報セキュリティの付加的な特性とは、<sapn class = "underline">「真正性」「責任追跡性」「否認防止」「信頼性」</sapn>の4つです。</p>
	<div class ="scroll_x">
		<table border = "1">
			<caption>情報セキュリティの付加的特性</caption>
			<tbody>
				<tr>
					<th>真正性</th>
					<td>利用者、プロセス、システム、情報などが、主張どおりであることを確実する特性のことです。<br>真正性を妨げる要因として<strong>なりすまし</strong>があげられます。</td>
				</tr>
				<tr>
					<th>責任追跡性</th>
					<td>情報を操作(閲覧・削除・変更)した人を追跡できる特性のことです。<br>責任追跡性を達成するためには<strong>ログ</strong>を保持しておくことが大切です。</td>
				</tr>
				<tr>
					<th>否認防止</th>
					<td>ある人物がある行為を行なったことを、後になって否定できないようにすることです。<br><strong>ログの改竄を防止</strong>したり、<strong>タイムスタンプ・ディジタル署名</strong>の利用が有効です。</td>
				</tr>
				<tr>
					<th>信頼性</th>
					<td>システムが期待通りの動作をすることです。<br>簡単に言えば「バグ」がないことを指します。</td>
				</tr>
			</tbody>
		</table>
	</div>


	<h2>OECDセキュリティガイドライン</h2>
	<p>経済協力開発機構(OECD)が提唱した情報セキュリティに関するガイドラインです。<br>簡単に言えば、<span class = "underline">システムを作る人(SE・プログラマ)もシステムを使う人(エンドユーザといいます)もセキュリティに注意を払おうね♪</span>ということです。<br><br>OECDセキュリティガイドラインでは<strong>「セキュリティ文化」</strong>という言葉を使用しています。セキュリティ文化とは、「情報システム及びネットワークを開発する際にセキュリティに注目し、また、情報システム及びネットワークを利用し、情報をやりとりするに当たり、新しい思考及び行動の様式を取り入れること」と定義されます。</p>



	<h2>情報セキュリティの重要性</h2>
	<p>IT、最近とってもブームですね♪<br>そのような社会において情報セキュリティは企業の存続を左右する状態にあります。<br>経営者・従業員全員でこのセキュリティ問題に取り組む必要があります。<br><br>情報セキュリティを対策の基本は<strong>守るべきものを攻撃から守る</strong>です。当たり前ですね♪ですけどとっても大切なので情報セキュリティ対策について順序立てて説明していきますね♪</p>
	<div class = li_caption>情報セキュリティ対策手順</div>
	<ol id = "importance_of_security">
		<li><strong>何を守るべきか(<strong>情報資産</strong>)</strong>を把握する</li>
		<li>どんな攻撃が飛んでくるか(<strong>脅威</strong>)を把握する</li>
		<li>どこを狙われるか(<strong>脆弱性</strong>)を把握する</li>
		<li>情報セキュリティの方針を明確にする♪</li>
	</ol>
	<div class = "svg_box">
		<svg
			id = "venn"
			width="400px"
			height="200px"
			viewBox="0 10 170 85"
			version="1.1"
			xmlns="http://www.w3.org/2000/svg"
			xmlns:svg="http://www.w3.org/2000/svg" >
			<ellipse
				id="venn_left"
				class="venn_left"
				cx="56.966145"
				cy="52.733368"
				rx="43.558125"
				ry="31.917984" />
			<ellipse
				id="venn_right"
				class="venn_right"
				cx="108.64133"
				cy="52.557003"
				rx="43.558125"
				ry="31.917984" />
			<path
				id="venn_center"
				class="venn_center"
				d="M 82.685567,26.911452 A 43.558123,31.917984 0 0 0 65.127469,52.515573 43.558123,31.917984 0 0 0 83.021464,78.290744 43.558123,31.917984 0 0 0 100.5682,52.691791 43.558123,31.917984 0 0 0 82.685567,26.911452 Z" />
			<text
				xml:space="preserve"
				transform="matrix(0.26458333,0,0,0.26458333,8.4655581,3.7036817)"
				id="text_left">
				<tspan
					x="85.322266"
					y="190.71484"
					class="venn_left">脆弱性
				</tspan>
			</text>
			<text
				xml:space="preserve"
				transform="matrix(0.26458333,0,0,0.26458333,2.1163895,1.7636579)"
				id="text_right" >
				<tspan
					x="417.2793"
					y="197.38086"
					class="venn_right">脅威
				</tspan>
			</text>
			<text
				xml:space="preserve"
				transform="matrix(0.26458333,0,0,0.26458333,4.7618765,1.9400238)"
				id="text_center" >
				<tspan
					x="260"
					y="200"
					id="risk"
					class="venn_center">リスク
				</tspan>
			</text>
		</svg>
	</div>
	<p>上の図で理解してほしいことは、「リスク(情報セキュリティリスク)がどのように生まれるか」です。<br>リスクは<span class = "underline">脆弱性 × 脅威</span>によって生まれます。<br><br>言い換えれば、<span class = "underline">脆弱性があっても(セキュリティが脆弱でも)脅威がなければ(誰も攻撃しなければ)リスクは発生しないし、脅威があっても(攻撃者が存在しても)脆弱性がなければ(セキュリティが強固であれば)リスクは発生しない</span>ということです。<br><br>この世界において攻撃者がいないというのは想定し得ないので、セキュリティに注意を払わないという選択肢はないのですが、脅威がどこを向いているか(どこが狙われやすいか)をしっかりと把握することが大切です。</p>

	<h2>サイバー空間</h2>
	<p>サイバー空間とは、、、<br><br>ITの力(コンピュータ・ネットワーク)によって創り出された仮想的な空間のことです。<br><strong>インターネット</strong>が代表的なサイバー空間です。<br><br>サイバー空間については、2011年に米国のクリントン国務長官が「サイバー空間の国際戦略」について公表して、サイバー空間についての基本原則を定めました。<br>この「サーバー空間の国際戦略」の内容を簡単に説明すると、<span class = "underline"><strong>「自由で」「安全で」「便利な」</strong></span>サイバー空間を形成しようね♪ってことです。</p>

	<h2>サイバー攻撃</h2>
	<p>このページを作成する約3カ月程前(2021年5月)、アメリカ最大の石油パイプラインであるコロニアル・パイプラインがハッキング集団ダークサイドのサイバー攻撃を受けて一時創業停止状態になりました。<br>コロニアル・パイプラインが保有するデータを暗号化して使えなくする「ランサムウェア」攻撃というサイバー攻撃だったのですが、この暗号を復号する為にコロニアル・パイプラインはダークサイドに5億円近い金額を支払う羽目になりました、、、<br><br>ITの利便性の裏にはこのような負の側面があります。<br>ITを用いる際には必ずセキュリティリスクを認識して適切な対応策をとる必要があります。<br><br><br>因みに、このランサムウェア攻撃は前述した情報セキュリティの特性(CIA)のうちのどれを損なわせる攻撃ですか???</p>
	<span id = "question_cyberattack">答え</span>
	<div id = "answer_cyberattack" class = "hidden">
		<span>A. 可用性(Availability)</span>
		<span>データを使えなくさせる攻撃は情報セキュリティ特性の可用性を損なわせます。</span>
	</div>
	<h2></h2>
</div>



<?php
include_footer();
?>


